#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 1s [id=820242942535]
data.aws_iam_policy_document.mswebappkms: Reading...
data.aws_iam_policy_document.mswebappkms: Read complete after 0s [id=2880519140]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.S3logsTLS will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "S3logsTLS" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "Allow HTTPS only"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
      + statement {
          + actions   = [
              + "s3*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "Allow TLS 1.2 and above"

          + condition {
              + test     = "NumericLessThan"
              + values   = [
                  + "1.2",
                ]
              + variable = "s3:TlsVersion"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "Allow ALB logging access regions available as of August 2022 or later"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::009996457667:root",
                  + "arn:aws:iam::027434742980:root",
                  + "arn:aws:iam::033677994240:root",
                  + "arn:aws:iam::054676820928:root",
                  + "arn:aws:iam::076674570225:root",
                  + "arn:aws:iam::098369216593:root",
                  + "arn:aws:iam::114774131450:root",
                  + "arn:aws:iam::127311923021:root",
                  + "arn:aws:iam::156460612806:root",
                  + "arn:aws:iam::383597477331:root",
                  + "arn:aws:iam::507241528517:root",
                  + "arn:aws:iam::582318560864:root",
                  + "arn:aws:iam::589379963580:root",
                  + "arn:aws:iam::600734575887:root",
                  + "arn:aws:iam::635631232127:root",
                  + "arn:aws:iam::652711504416:root",
                  + "arn:aws:iam::718504428378:root",
                  + "arn:aws:iam::754344448648:root",
                  + "arn:aws:iam::783225319266:root",
                  + "arn:aws:iam::797873946194:root",
                  + "arn:aws:iam::897822967062:root",
                  + "arn:aws:iam::985666609251:root",
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_cloudwatch_log_group.ecscluster will be created
  + resource "aws_cloudwatch_log_group" "ecscluster" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "ghablogcwltsecscluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags              = {
          + "Name"         = "ghablogcwltsecscluster"
          + "codeblock"    = "ecscluster"
          + "resourcetype" = "monitor"
        }
      + tags_all          = {
          + "Environment"  = "Testing"
          + "Name"         = "ghablogcwltsecscluster"
          + "Provisioner"  = "Terraform"
          + "Solution"     = "AWS-GHA-TF-MSFT"
          + "codeblock"    = "ecscluster"
          + "resourcetype" = "monitor"
        }
    }

  # aws_cloudwatch_log_group.mswebapp will be created
  + resource "aws_cloudwatch_log_group" "mswebapp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "ghablogcwltsmswebapp"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Name"         = "ghablogcwltsmswebapp"
          + "codeblock"    = "ecscluster"
          + "resourcetype" = "monitor"
        }
      + tags_all          = {
          + "Environment"  = "Testing"
          + "Name"         = "ghablogcwltsmswebapp"
          + "Provisioner"  = "Terraform"
          + "Solution"     = "AWS-GHA-TF-MSFT"
          + "codeblock"    = "ecscluster"
          + "resourcetype" = "monitor"
        }
    }

  # aws_cloudwatch_log_group.vpc_01 will be created
  + resource "aws_cloudwatch_log_group" "vpc_01" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "ghablogcwltsvpc01flow"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags              = {
          + "Name"         = "ghablogcwltsvpc01flow"
          + "codeblock"    = "network"
          + "resourcetype" = "monitor"
        }
      + tags_all          = {
          + "Environment"  = "Testing"
          + "Name"         = "ghablogcwltsvpc01flow"
          + "Provisioner"  = "Terraform"
          + "Solution"     = "AWS-GHA-TF-MSFT"
          + "codeblock"    = "network"
          + "resourcetype" = "monitor"
        }
    }

  # aws_ecr_lifecycle_policy.mswebapp will be created
  + resource "aws_ecr_lifecycle_policy" "mswebapp" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images after one day"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 1
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "mswebapp"
    }

  # aws_ecr_repository.mswebapp will be created
  + resource "aws_ecr_repository" "mswebapp" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "mswebapp"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name"         = "ghablogecstsmswebapp"
          + "codeblock"    = "ecscluster"
          + "resourcetype" = "compute"
        }
      + tags_all             = {
          + "Environment"  = "Testing"
          + "Name"         = "ghablogecstsmswebapp"
          + "Provisioner"  = "Terraform"
          + "Solution"     = "AWS-GHA-TF-MSFT"
          + "codeblock"    = "ecscluster"
          + "resourcetype" = "compute"
        }

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecs_cluster.mswebapp will be created
  + resource "aws_ecs_cluster" "mswebapp" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "ghablogecstsmswebapp"
      + tags     = {
          + "Name"         = "ghablogecstsmswebapp"
          + "codeblock"    = "ecscluster"
          + "resourcetype" = "storage"
        }
      + tags_all = {
          + "Environment"  = "Testing"
          + "Name"         = "ghablogecstsmswebapp"
          + "Provisioner"  = "Terraform"
          + "Solution"     = "AWS-GHA-TF-MSFT"
          + "codeblock"    = "ecscluster"
          + "resourcetype" = "storage"
        }

      + configuration {
          + execute_command_configuration {
              + kms_key_id = (known after apply)
              + logging    = "OVERRIDE"

              + log_configuration {
                  + cloud_watch_encryption_enabled = true
                  + cloud_watch_log_group_name     = "ghablogcwltsecscluster"
                }
            }
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.mswebapp will be created
  + resource "aws_ecs_service" "mswebapp" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "ap-southeast-2iartssvcmswebapp"
      + platform_version                   = (known after apply)
      + propagate_tags                     = "TASK_DEFINITION"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name"  = "ap-southeast-2iartssvcmswebapp"
          + "rtype" = "ecsservice"
        }
      + tags_all                           = {
          + "Environment" = "Testing"
          + "Name"        = "ap-southeast-2iartssvcmswebapp"
          + "Provisioner" = "Terraform"
          + "Solution"    = "AWS-GHA-TF-MSFT"
          + "rtype"       = "ecsservice"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "mswebapp"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.mswebapp will be created
  + resource "aws_ecs_task_definition" "mswebapp" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu                    = 256
                  + essential              = true
                  + image                  = "820242942535.dkr.ecr.ap-southeast-2.amazonaws.com/mswebapp:1.0.0"
                  + logConfiguration       = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "ghablogcwltsmswebapp"
                          + awslogs-region        = "ap-southeast-2"
                          + awslogs-stream-prefix = "awslogs-"
                        }
                    }
                  + memory                 = 512
                  + name                   = "mswebapp"
                  + portMappings           = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                          + protocol      = "tcp"
                        },
                    ]
                  + readonlyRootFilesystem = true
                },
            ]
        )
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "ghablogecttsmswebapp"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "Environment" = "Testing"
          + "Provisioner" = "Terraform"
          + "Solution"    = "AWS-GHA-TF-MSFT"
        }
      + track_latest             = false
    }

  # aws_eip.eip_nat_01 will be created
  + resource "aws_eip" "eip_nat_01" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"         = "ghablogeipts01"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "network"
        }
      + tags_all             = {
          + "Environment"  = "Testing"
          + "Name"         = "ghablogeipts01"
          + "Provisioner"  = "Terraform"
          + "Solution"     = "AWS-GHA-TF-MSFT"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "network"
        }
      + vpc                  = (known after apply)
    }

  # aws_eip.eip_nat_02 will be created
  + resource "aws_eip" "eip_nat_02" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"         = "ghablogeipts02"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "network"
        }
      + tags_all             = {
          + "Environment"  = "Testing"
          + "Name"         = "ghablogeipts02"
          + "Provisioner"  = "Terraform"
          + "Solution"     = "AWS-GHA-TF-MSFT"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "network"
        }
      + vpc                  = (known after apply)
    }

  # aws_flow_log.vpc_01 will be created
  + resource "aws_flow_log" "vpc_01" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags_all                 = {
          + "Environment" = "Testing"
          + "Provisioner" = "Terraform"
          + "Solution"    = "AWS-GHA-TF-MSFT"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # aws_iam_role.ecstaskexec will be created
  + resource "aws_iam_role" "ecstaskexec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ghablogiartsecstaskexec"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name"  = "ap-southeast-2iartsecstaskexec"
          + "rtype" = "security"
        }
      + tags_all              = {
          + "Environment" = "Testing"
          + "Name"        = "ap-southeast-2iartsecstaskexec"
          + "Provisioner" = "Terraform"
          + "Solution"    = "AWS-GHA-TF-MSFT"
          + "rtype"       = "security"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.vpclogging will be created
  + resource "aws_iam_role" "vpclogging" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ghablogiartsvpclogging"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name"  = "ap-southeast-2iartsvpclogging"
          + "rtype" = "security"
        }
      + tags_all              = {
          + "Environment" = "Testing"
          + "Name"        = "ap-southeast-2iartsvpclogging"
          + "Provisioner" = "Terraform"
          + "Solution"    = "AWS-GHA-TF-MSFT"
          + "rtype"       = "security"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.ecstaskexec will be created
  + resource "aws_iam_role_policy" "ecstaskexec" {
      + id          = (known after apply)
      + name        = "ap-southeast-2irptsecstaskexec"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.vpclogging will be created
  + resource "aws_iam_role_policy" "vpclogging" {
      + id          = (known after apply)
      + name        = "ap-southeast-2irptsvpclogging"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:*:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_internet_gateway.internet_gateway_01 will be created
  + resource "aws_internet_gateway" "internet_gateway_01" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"         = "ghablogigwts01"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "network"
        }
      + tags_all = {
          + "Environment"  = "Testing"
          + "Name"         = "ghablogigwts01"
          + "Provisioner"  = "Terraform"
          + "Solution"     = "AWS-GHA-TF-MSFT"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "network"
        }
      + vpc_id   = (known after apply)
    }

  # aws_kms_alias.mswebapp will be created
  + resource "aws_kms_alias" "mswebapp" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/mswebapp"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.mswebapp will be created
  + resource "aws_kms_key" "mswebapp" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "KMS key to secure various aspects of an example Microsoft .NET web application"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::820242942535:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt*",
                          + "kms:Describe*",
                          + "kms:Decrypt*",
                        ]
                      + Condition = {
                          + ArnLike = {
                              + "kms:EncryptionContext:aws:logs:arn" = "arn:aws:logs:ap-southeast-2:820242942535:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.ap-southeast-2.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow Cloudwatch access to KMS Key"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                               = {
          + "Name"         = "ghablogkmstsmswebapp"
          + "codeblock"    = "ecscluster"
          + "resourcetype" = "security"
        }
      + tags_all                           = {
          + "Environment"  = "Testing"
          + "Name"         = "ghablogkmstsmswebapp"
          + "Provisioner"  = "Terraform"
          + "Solution"     = "AWS-GHA-TF-MSFT"
          + "codeblock"    = "ecscluster"
          + "resourcetype" = "security"
        }
    }

  # aws_lb.mswebapp will be created
  + resource "aws_lb" "mswebapp" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "ghablogalbtsmswebapp"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Name"  = "ap-southeast-2albtsmswebapp"
          + "rtype" = "network"
        }
      + tags_all                                                     = {
          + "Environment" = "Testing"
          + "Name"        = "ap-southeast-2albtsmswebapp"
          + "Provisioner" = "Terraform"
          + "Solution"    = "AWS-GHA-TF-MSFT"
          + "rtype"       = "network"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = (known after apply)
          + enabled = true
          + prefix  = "albaccesslogs"
        }
    }

  # aws_lb_listener.mswebapp will be created
  + resource "aws_lb_listener" "mswebapp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "Name"  = "ap-southeast-2lbltsmswebapp"
          + "rtype" = "network"
        }
      + tags_all          = {
          + "Environment" = "Testing"
          + "Name"        = "ap-southeast-2lbltsmswebapp"
          + "Provisioner" = "Terraform"
          + "Solution"    = "AWS-GHA-TF-MSFT"
          + "rtype"       = "network"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.mswebapp will be created
  + resource "aws_lb_target_group" "mswebapp" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = "round_robin"
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "msweb-"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"  = "ap-southeast-2lbttsmswebapp"
          + "rtype" = "network"
        }
      + tags_all                           = {
          + "Environment" = "Testing"
          + "Name"        = "ap-southeast-2lbttsmswebapp"
          + "Provisioner" = "Terraform"
          + "Solution"    = "AWS-GHA-TF-MSFT"
          + "rtype"       = "network"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = 86400
          + enabled         = true
          + type            = "lb_cookie"
        }
    }

  # aws_nat_gateway.nat_gateway_01 will be created
  + resource "aws_nat_gateway" "nat_gateway_01" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"         = "ghablogngwts01"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "network"
        }
      + tags_all                           = {
          + "Environment"  = "Testing"
          + "Name"         = "ghablogngwts01"
          + "Provisioner"  = "Terraform"
          + "Solution"     = "AWS-GHA-TF-MSFT"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "network"
        }
    }

  # aws_nat_gateway.nat_gateway_02 will be created
  + resource "aws_nat_gateway" "nat_gateway_02" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"         = "ghablogngwts02"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "network"
        }
      + tags_all                           = {
          + "Environment"  = "Testing"
          + "Name"         = "ghablogngwts02"
          + "Provisioner"  = "Terraform"
          + "Solution"     = "AWS-GHA-TF-MSFT"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "network"
        }
    }

  # aws_resourcegroups_group.Terraform will be created
  + resource "aws_resourcegroups_group" "Terraform" {
      + arn         = (known after apply)
      + description = "Terraform created demo environment resources"
      + id          = (known after apply)
      + name        = "ghablogrggtsdemoall"
      + tags        = {
          + "Name"  = "ghablogrggtsdemoall"
          + "rtype" = "scaffold"
        }
      + tags_all    = {
          + "Environment" = "Testing"
          + "Name"        = "ghablogrggtsdemoall"
          + "Provisioner" = "Terraform"
          + "Solution"    = "AWS-GHA-TF-MSFT"
          + "rtype"       = "scaffold"
        }

      + resource_query {
          + query = jsonencode(
                {
                  + ResourceTypeFilters = [
                      + "AWS::AllSupported",
                    ]
                  + TagFilters          = [
                      + {
                          + Key    = "Solution"
                          + Values = [
                              + "AWS-GHA-TF-MSFT",
                            ]
                        },
                    ]
                }
            )
          + type  = "TAG_FILTERS_1_0"
        }
    }

  # aws_route_table.priv_01 will be created
  + resource "aws_route_table" "priv_01" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name"         = "ghablogrttpvts01"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "network"
        }
      + tags_all         = {
          + "Environment"  = "Testing"
          + "Name"         = "ghablogrttpvts01"
          + "Provisioner"  = "Terraform"
          + "Solution"     = "AWS-GHA-TF-MSFT"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "network"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.priv_02 will be created
  + resource "aws_route_table" "priv_02" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name"         = "ghablogrttpvts02"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "network"
        }
      + tags_all         = {
          + "Environment"  = "Testing"
          + "Name"         = "ghablogrttpvts02"
          + "Provisioner"  = "Terraform"
          + "Solution"     = "AWS-GHA-TF-MSFT"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "network"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.pub_01 will be created
  + resource "aws_route_table" "pub_01" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name"         = "ghablogrttpbts01"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "network"
        }
      + tags_all         = {
          + "Environment"  = "Testing"
          + "Name"         = "ghablogrttpbts01"
          + "Provisioner"  = "Terraform"
          + "Solution"     = "AWS-GHA-TF-MSFT"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "network"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.pub_01 will be created
  + resource "aws_route_table_association" "pub_01" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.pub_02 will be created
  + resource "aws_route_table_association" "pub_02" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.pv_01 will be created
  + resource "aws_route_table_association" "pv_01" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.pv_02 will be created
  + resource "aws_route_table_association" "pv_02" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_s3_bucket.alblogs will be created
  + resource "aws_s3_bucket" "alblogs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "ghablogssstsalblogs"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"      = "ghablogssstsalblogs"
          + "codeblock" = "lzbase"
          + "rtype"     = "storage"
        }
      + tags_all                    = {
          + "Environment" = "Testing"
          + "Name"        = "ghablogssstsalblogs"
          + "Provisioner" = "Terraform"
          + "Solution"    = "AWS-GHA-TF-MSFT"
          + "codeblock"   = "lzbase"
          + "rtype"       = "storage"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_policy.alblogs will be created
  + resource "aws_s3_bucket_policy" "alblogs" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.alblogs will be created
  + resource "aws_s3_bucket_public_access_block" "alblogs" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_versioning.alblogs will be created
  + resource "aws_s3_bucket_versioning" "alblogs" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_security_group.app01 will be created
  + resource "aws_security_group" "app01" {
      + arn                    = (known after apply)
      + description            = " Application Security Group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Application Outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Application Inbound"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = (known after apply)
              + self             = true
              + to_port          = 0
            },
        ]
      + name                   = "ghablogscgtsapp01"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"         = "ghablogscgtsapp01"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "security"
        }
      + tags_all               = {
          + "Environment"  = "Testing"
          + "Name"         = "ghablogscgtsapp01"
          + "Provisioner"  = "Terraform"
          + "Solution"     = "AWS-GHA-TF-MSFT"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "security"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.web01 will be created
  + resource "aws_security_group" "web01" {
      + arn                    = (known after apply)
      + description            = "Web Security Group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Web Outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "138.199.33.228/32",
                ]
              + description      = "Web Inbound"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "ghablogscgtsweb01"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"         = "ghablogscgtsweb01"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "security"
        }
      + tags_all               = {
          + "Environment"  = "Testing"
          + "Name"         = "ghablogscgtsweb01"
          + "Provisioner"  = "Terraform"
          + "Solution"     = "AWS-GHA-TF-MSFT"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "security"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.priv_subnet_01 will be created
  + resource "aws_subnet" "priv_subnet_01" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"         = "ghablogsbnpvts01"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "network"
        }
      + tags_all                                       = {
          + "Environment"  = "Testing"
          + "Name"         = "ghablogsbnpvts01"
          + "Provisioner"  = "Terraform"
          + "Solution"     = "AWS-GHA-TF-MSFT"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "network"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.priv_subnet_02 will be created
  + resource "aws_subnet" "priv_subnet_02" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"         = "ghablogsbnpvts02"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "network"
        }
      + tags_all                                       = {
          + "Environment"  = "Testing"
          + "Name"         = "ghablogsbnpvts02"
          + "Provisioner"  = "Terraform"
          + "Solution"     = "AWS-GHA-TF-MSFT"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "network"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.pub_subnet_01 will be created
  + resource "aws_subnet" "pub_subnet_01" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"         = "ghablogsbnpbts01"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "network"
        }
      + tags_all                                       = {
          + "Environment"  = "Testing"
          + "Name"         = "ghablogsbnpbts01"
          + "Provisioner"  = "Terraform"
          + "Solution"     = "AWS-GHA-TF-MSFT"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "network"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.pub_subnet_02 will be created
  + resource "aws_subnet" "pub_subnet_02" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"         = "ghablogsbnpbts02"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "network"
        }
      + tags_all                                       = {
          + "Environment"  = "Testing"
          + "Name"         = "ghablogsbnpbts02"
          + "Provisioner"  = "Terraform"
          + "Solution"     = "AWS-GHA-TF-MSFT"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "network"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.vpc_01 will be created
  + resource "aws_vpc" "vpc_01" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.31.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"         = "ghablogvpcts01"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "network"
        }
      + tags_all                             = {
          + "Environment"  = "Testing"
          + "Name"         = "ghablogvpcts01"
          + "Provisioner"  = "Terraform"
          + "Solution"     = "AWS-GHA-TF-MSFT"
          + "codeblock"    = "network-3tier"
          + "resourcetype" = "network"
        }
    }

Plan: 42 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + mswebapp_alb_dns_name = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ndpalmer, Action: `pull_request`, Working Directory: ``, Workflow: `Review and deploy Test environment`*